<!-- dflook/terraform-github-actions {"workspace":"dflook-patch-1-2","backend_type":"remote","backend":"4bc7016210a08e1595e524813cd88f0f47258901b156dca216773c4c303823ee","plan_job_ref":"Job Test Terraform cloud #359 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369241","plan_hash":"b80b682a78835442c18c0208eb5205a5a46670c54722a12d51808c7e34a37ba7","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __dflook-patch-1-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #359](https://github.com/dflook/terraform-github-actions/actions/runs/17349369241)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>